# Требуется вычислить, сколько раз встречается некоторое число k в массиве list_1.
# Найдите количество и выведите его.

list_1 = [1, 2, 3, 4, 5, 3, 6, 7, 4, 3]
k = 3
count = 0
while k in list_1:
    list_1.remove(k)
    count += 1

print(count)
