
# Напишите программу, которая вычисляет стоимость введенного пользователем слова k и выводит его.
# Будем считать, что на вход подается только одно слово, которое содержит либо только английские,
# либо только русские буквы.

chars = {1: "AEIOULNSTRАВЕИНОРСТ",
         2: "DGДКЛМПУ",
         3: "BCMPБГЁЬЯ",
         4: "FHVWYЙЫ",
         5: "KЖЗХЦЧ",
         8: "JXШЭЮ",
         10: "QZФЩЪ"}
points = 0
k = 'ноутбук'

for char in k:
    for key in chars:
        if char.upper() in chars[key]:
            points += key
print(points)
